GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
    #ifdef BSP_USING_UART2
    {
        USART2,                                /* uart peripheral index */
        RCU_USART2,                            /* uart periph clock */
        USART2_IRQn,                           /* uart iqrn */
        "uart2",
        &serial2,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_USING_UART_TX_DMA
        &uart2_txdma,
#endif
#ifdef BSP_USING_UART_TX_DMA
        &uart2_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART3
    {
        UART3,                                 /* uart peripheral index */
        RCU_UART3,                             /* uart periph clock */
        UART3_IRQn,                            /* uart iqrn */
        "uart3",
        &serial3,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_USING_UART_TX_DMA
        &uart3_txdma,
#endif
#ifdef BSP_USING_UART_TX_DMA
        &uart3_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART4
    {
        UART4,                                 /* uart peripheral index */
        RCU_UART4,                             /* uart periph clock */
        UART4_IRQn,                            /* uart iqrn */
        "uart4",
        &serial4,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_USING_UART_TX_DMA
        &uart4_txdma,
#endif
#ifdef BSP_USING_UART_TX_DMA
        &uart4_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART5
    {
        USART5,                                /* uart peripheral index */
        RCU_USART5,                            /* uart periph clock */
        USART5_IRQn,                           /* uart iqrn */
        "uart5",
        &serial5,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_USING_UART_TX_DMA
        &uart5_txdma,
#endif
#ifdef BSP_USING_UART_TX_DMA
        &uart5_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART6
    {
        UART6,                                 /* uart peripheral index */
        RCU_UART6,                             /* uart periph clock */
        UART6_IRQn,                            /* uart iqrn */
        "uart6",
        &serial6,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_USING_UART_TX_DMA
        &uart6_txdma,
#endif
#ifdef BSP_USING_UART_TX_DMA
        &uart6_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART7
    {
        UART7,                                 /* uart peripheral index */
        RCU_UART7,                             /* uart periph clock */
        UART7_IRQn,                            /* uart iqrn */
        "uart7",
        &serial7,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_USING_UART_TX_DMA
        &uart7_txdma,
#endif
#ifdef BSP_USING_UART_RX_DMA
        &uart7_rxdma,
#endif
#endif
    },
    #endif
};
#endif

#if !defined(SOC_SERIES_GD32H75E) && !defined(SOC_SERIES_GD32E51x)  && !defined(SOC_SERIES_GD32F3x0)
/**
* @brief UART MSP Initialization
*        This function configures the hardware resources used in this example:
*           - Peripheral's clock enable
*           - Peripheral's GPIO Configuration
*           - NVIC configuration for UART interrupt request enable
* @param huart: UART handle pointer
* @retval None
*/
void gd32_uart_gpio_init(struct gd32_uart *uart)
{
    /* enable USART clock */
    rcu_periph_clock_enable(uart->tx_gpio_clk);
    rcu_periph_clock_enable(uart->rx_gpio_clk);
    rcu_periph_clock_enable(uart->uart_clk);

#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx || defined SOC_SERIES_GD32E23x
    /* connect port to USARTx_Tx */
    gpio_af_set(uart->tx_port, uart->tx_af, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_af_set(uart->rx_port, uart->rx_af, uart->rx_pin);

    /* configure USART Tx as alternate function push-pull */
    gpio_mode_set(uart->tx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->tx_pin);
    gpio_output_options_set(uart->tx_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, uart->tx_pin);

    /* configure USART Rx as alternate function push-pull */
    gpio_mode_set(uart->rx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->rx_pin);
    gpio_output_options_set(uart->rx_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, uart->rx_pin);

#elif defined SOC_SERIES_GD32H7xx
    /* connect port to USARTx_Tx */
    gpio_af_set(uart->tx_port, uart->tx_af, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_af_set(uart->rx_port, uart->rx_af, uart->rx_pin);

    /* configure USART Tx as alternate function push-pull */
    gpio_mode_set(uart->tx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->tx_pin);
    gpio_output_options_set(uart->tx_port, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, uart->tx_pin);

    /* configure USART Rx as alternate function push-pull */
    gpio_mode_set(uart->rx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->rx_pin);
    gpio_output_options_set(uart->rx_port, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, uart->rx_pin);

#elif defined SOC_SERIES_GD32E50x
    /* configure remap function */
    if (uart->uart_remap != 0)
    {
        rcu_periph_clock_enable(RCU_AF);
        gpio_pin_remap_config(uart->uart_remap, ENABLE);
    }

    /* connect port to USARTx_Tx */
    gpio_init(uart->tx_port, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_init(uart->rx_port, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, uart->rx_pin);

    /* configure alternate1 function */
    if (uart->tx_af != 0 || uart->rx_af != 0)
    {
        rcu_periph_clock_enable(RCU_AF);
        if (uart->tx_af != 0)
            gpio_afio_port_config(uart->tx_af, ENABLE);
        if (uart->rx_af != 0)
            gpio_afio_port_config(uart->rx_af, ENABLE);
    }

#else
    /* connect port to USARTx_Tx */
    gpio_init(uart->tx_port, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_init(uart->rx_port, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, uart->rx_pin);
#endif

    NVIC_SetPriority(uart->irqn, 0);
    NVIC_EnableIRQ(uart->irqn);
}
#endif

/**
  * @brief  uart configure
  * @param  serial, cfg
  * @retval None
  */
static rt_err_t gd32_uart_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

